PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/benchmark/mai_main.c
/**
 * @file mai_main.c
 *   C entry function. The core completes the HW initialization (clocks run at full speed,
 * drivers for MPU and devices are initialized).\n
 *   The safe-RTOS is configured to run a few tasks, both OS and user mode tasks, which
 * drive the user LEDs. The user tasks injects a very few failures in order to demonstrate
 * the error catching capabilities of the RTOS.\n
 *   Only if all the LEDs are blinking everything is alright.\n
 *   Progress information is permanently written into the serial output channel. A terminal
 * on the development host needs to use these settings: 115000 Bd, 8 Bit data word, no
 * parity, 1 stop bit.
 *
 * Copyright (C) 2017-2020 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   main
 * Local functions
 *   taskInitProcess
 *   isrPit1
 *   isrPit2
 *   isrPit3
 *   taskUserPit2
 *   taskUser1ms
 *   taskUser10ms
 *   taskUser100ms
 *   taskUser1000ms
 *   taskOSIdle
 *   taskOS1ms
 *   taskOS5ms
 *   taskOS10ms
 *   taskSafety1ms
 *   installInterruptServiceRoutines
 */

/*
 * Include files
 */

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>
#include <assert.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "ihw_initMcuCoreHW.h"
#include "lbd_ledAndButtonDriver.h"
#include "sio_serialIO.h"
#include "rtos.h"
#include "del_delay.h"
#include "gsl_systemLoad.h"
//#include "mai_main.h"


/*
 * Defines
 */

/* The demo simulates a typical true RTOS application. These macros specify how much load
   each  task produces. The values mean CPU load in percent. */
#define LOAD_TASK_SAFETY_1MS    2
#define LOAD_TASK_PIT2          5
#define LOAD_TASK_1MS           5
#define LOAD_TASK_10MS          35
#define LOAD_TASK_100MS         7
#define LOAD_TASK_1000MS        5
#define LOAD_TASK_OS_1MS        3
#define LOAD_TASK_OS_5MS        5
#define LOAD_TASK_OS_10MS       5

/** Configuration of simulation: The fraction of the computation time a task typically
    spends in its pro- or epilogue, which means copying of in- and output data inside a
    critical section. */
#define REL_LOAD_TASK_INTERFACE     0.05f

/** Configuration of simulation: The fraction of the computation time a task typically
    spends in its true activities - outside of critical sections. */
#define REL_LOAD_TASK_COMPUTATION   (1.0f - 2.0f*(REL_LOAD_TASK_INTERFACE))


/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look similar to the API calls from the OSEK/VDX
    standard.
      Here, for getting the resource, i.e. for entering a critical section of code. */
#define getResource(maxPrioOfCompetingTasks) \
            rtos_suspendAllTasksByPriority(maxPrioOfCompetingTasks)

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for returning the resource, i.e. for leaving a critical section of code. */
#define releaseResource(prioOfTask) rtos_resumeAllTasksByPriority(prioOfTask)

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for getting the resource, i.e. for entering a critical section of code.\n
      Here for OS tasks (including idle task). */
#define osGetResource(maxPrioOfCompetingTasks) \
            rtos_osSuspendAllTasksByPriority(maxPrioOfCompetingTasks)

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.\n
      Here, for returning the resource, i.e. for leaving a critical section of code.\n
      Here for OS tasks (including idle task). */
#define osReleaseResource(prioOfTask) rtos_osResumeAllTasksByPriority(prioOfTask)

/** Helper macro to produce the wanted CPU load in the simulation of a typical task. It
    simply consumes a given amount of computation time by busy wait. The time is meant in
    true CPU instructions, not as world time. Preemptions of the calling task will
    accordingly prolonge the time till return from busyWait.
      @param cpuLoad The average CPU load produced by this macro given it is called in
    every activation of a cyclic task with cylce time \a tiCycleInMs.
      @param tiCycleInMs The cycle time of the simulated, cyclic task, which makes use of
    the macro. */
#define busyWait(cpuLoad, tiCycleInMs) \
            del_delayMicroseconds \
                (/* tiCpuInUs */ (uint32_t)((cpuLoad)/100.0f * tiCycleInMs * 1000.0f + 0.5))


/*
 * Local type definitions
 */

/** The enumeration of all events, tasks and priorities, to have them as symbols in the
    source code. Most relevant are the event IDs. Actually, these IDs are provided by the
    RTOS at runtime, when creating the event. However, it is guaranteed that the IDs, which
    are dealt out by rtos_osCreateEvent() form the series 0, 1, 2, .... So we don't need
    to have a dynamic storage of the IDs; we define them as constants and double-check by
    assertion that we got the correct, expected IDs from rtos_osCreateEvent(). Note, this
    requires that the order of creating the events follows the order here in the
    enumeration.\n
      Here we have the IDs of the created events. They occupy the index range starting from
    zero. */
enum idEvent_t
{
    idEv1msSafety = 0,  /// Event for safety task
    idEvPit2,           /// Event for task following the PIT2 interrupt
    idEv1ms,            /// Event for cyclic tasks of 1 ms
    idEv5ms,            /// Event for cyclic tasks of 5 ms
    idEv10ms,           /// Event for cyclic tasks of 10 ms
    idEv100ms,          /// Event for cyclic tasks of 100 ms
    idEv1000ms,         /// Event for cyclic tasks of 1000 ms

    /** The number of events. */
    noRegisteredEvents
};


/** The RTOS uses constant priorities for its events, which are defined here.\n
      Note, the priority is a property of an event rather than of a task. A task implicitly
    inherits the priority of the event it is associated with. */
enum prioEvent_t
{
    prioTaskIdle = 0,   /// Prio 0 of idle task is implicit, cannot be chosen explicitly
    prioEv1000ms,       /// Prio of event for cyclic tasks of 1000 ms
    prioEv100ms,        /// Prio of event for cyclic tasks of 100 ms
    prioEv10ms,         /// Prio of event for cyclic tasks of 10 ms
    prioEv5ms,          /// Prio of event for cyclic tasks of 5 ms
    prioEv1ms,          /// Prio of event for cyclic tasks of 1 ms
    prioEvPit2,         /// Prio of event triggered from the ISR for the PIT2 interrupt
    prioEv1msSafety = RTOS_MAX_LOCKABLE_TASK_PRIORITY+1,  /// Event for safety task
};


/** The INTC riorities of the interrupts in use. These priorities constitute another space
    as the task priorities. */
enum prioIRQ_t
{
    prioIrqPit1 = RTOS_KERNEL_IRQ_PRIORITY-2,   /** INTC priority of timer IRQ PIT1 */
    prioIrqPit2 = RTOS_KERNEL_IRQ_PRIORITY,     /** INTC priority of timer IRQ PIT2 */
    prioIrqPit3 = RTOS_KERNEL_IRQ_PRIORITY+3,   /** INTC priority of timer IRQ PIT3 */
};


/** In safe-RTOS a task belongs to a process, characterized by the PID, 1..4. The
    relationship is defined here.\n
      Note, a process needs to be configured in the linker script (actually: assignment of
    stack space) before it can be used. */
enum pidOfTask_t
{
    pidOs = 0,         /* Kernel always and implicitly has PID 0 */
    pidTaskIdle = 0,   /* Prio 0 of idle task is implicit, cannot be chosen explicitly */
    pidTask1000ms = 1, /* PID of cyclic 1000 ms user task */
    pidTask100ms = 1,  /* PID of cyclic 100 ms user task */
    pidTask10ms = 1,   /* PID of cyclic 10 ms user task */
    pidTask1ms = 1,    /* PID of cyclic 1 ms user task */
    pidTaskPit2 = 1,   /* PID of user task that is triggered by asynchronous interrupt */
    pidOsTask10ms,     /* PID of cyclic 10 ms OS task */
    pidOsTask5ms,      /* PID of cyclic 5 ms OS task */
    pidOsTask1ms,      /* PID of cyclic 1 ms OS task */
    pidTask1msSafety = 2,  /* PID for safety task */
};




