PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/benchmark/mai_main.c
/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/** Counter of calls of ISR for PIT1 interrupt. */
volatile unsigned long SBSS_OS(mai_cntISRPit1) = 0;

/** Counter of calls of ISR for PIT2 interrupt. */
volatile unsigned long SBSS_OS(mai_cntISRPit2) = 0;

/** Counter of calls of ISR for PIT3 interrupt. */
volatile unsigned long SBSS_OS(mai_cntISRPit3) = 0;

/** Counter of asynchronous event task, triggered from PIT2 interrupt. */
volatile unsigned long SBSS_P1(mai_cntTaskUserPit2) = 0;

/** Counter of cyclic safety task. */
volatile unsigned long SBSS_P2(mai_cntTaskSafety1ms) = 0;

/** Counter of cycles of infinite main loop. */
volatile unsigned long SBSS_OS(mai_cntTaskIdle) = 0;

/** The average CPU load produced by all tasks and interrupts in tens of percent. */
unsigned int SDATA_OS(mai_cpuLoad) = 1000;


/*
 * Function implementation
 */

/**
 * Initialization task of process \a PID.
 *   @return
 * The function returns the Boolean descision, whether the initialization was alright and
 * the system can start up. "Not alright" is expressed by a negative number, which hinders
 * the RTOS to startup.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @remark
 * In this sample, we demonstrate that different processes' tasks can share the same task
 * function implementation. This is meant a demonstration of the technical feasibility but
 * not of good practice; the implementation needs to use shared memory, which may break a
 * safety constraint, and it needs to consider the different privileges of the processes.
 */
static int32_t taskInitProcess(uint32_t PID)
{
    _Static_assert(prioTaskIdle == 0
                   &&  prioEv1000ms > prioTaskIdle
                   &&  prioEv100ms > prioEv1000ms
                   &&  prioEv10ms > prioEv100ms
                   &&  prioEv5ms > prioEv10ms
                   &&  prioEv1ms > prioEv5ms
                   &&  prioEvPit2 > prioEv1ms
                   &&  prioEvPit2 <= RTOS_MAX_LOCKABLE_TASK_PRIORITY
                   &&  prioEv1msSafety > RTOS_MAX_LOCKABLE_TASK_PRIORITY
                  , "Bad task priority configuration"
                  );

    static unsigned int cnt_ SECTION(.data.Shared.cnt_) = 0;
    ++ cnt_;

    /* Scheduler test: Check order of initialization calls. */
    assert(cnt_ == PID);
    return cnt_ == PID? 0: -1;

} /* End of taskInitProcess */



/**
 * A regularly triggered interrupt handler for the timer PIT1. The interrupt does nothing
 * but counting a variable. It is triggered at medium frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context
 * switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit1(void)
{
    ++ mai_cntISRPit1;

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG1.B.TIF = 0x1;

} /* End of isrPit1 */



/**
 * A regularly triggered interrupt handler for the timer PIT2. The interrupt does nothing
 * but counting a variable. It is triggered at high frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit2(void)
{
    ++ mai_cntISRPit2;

    /* This ISR delegates some computation to a user task. It triggers the task. Note, that
       triggering will not necessarily succeed; see startup code, we have enebaled the
       interrupts earlier than the task scheduler. */         
    const unsigned long tmpCntTaskUserPit2 ATTRIB_DBG_ONLY = mai_cntTaskUserPit2;
    rtos_osTriggerEvent(idEvPit2);
    /* There must be no immediate counter change of the task. It will be started after
       return from the ISR and depending on the task priorities. */
    assert(tmpCntTaskUserPit2 == mai_cntTaskUserPit2);

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG2.B.TIF = 0x1;

} /* End of isrPit2 */



/**
 * A regularly triggered interrupt handler for the timer PIT3. The interrupt does nothing
 * but counting a variable. It is triggered at high frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit3(void)
{
    ++ mai_cntISRPit3;

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG3.B.TIF = 0x1;

} /* End of isrPit3 */



/**
 * Simulated user task. It is characterized mainly by the CPU load in percent is requires
 * to complete.
 *   A small, fixed fraction of the load is spent for the in- and output of the task. We
 * simulate the concept that at the beginning of the task some data is copied into local
 * task storage, before the actual task computations start and that - after computation -
 * another small fraction of the computation time is required to store the data for use by
 * other tasks.
 *   For our intention, getting a measure for the cost of the kernel, the actual
 * operations, copying data, doing some computations, copying data, doesn't matter at all.
 * However, it matters that copying data has to be done inside critical sections. This has
 * an impact on scheduling timing and it is a relative expensive operation for a safe
 * kernel, which must not offer the cheap suspension of all interrupts.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process. This mechanism is used to report a problem in PRODUCTION
 * compilation, when we have no assertions available.
 *   @param PID
 * The ID of the process, the task function is executed in.
 */
static int32_t taskUserPit2(uint32_t PID ATTRIB_UNUSED)
{                                                                                           
    bool success = true;                                                                    
                                                                                            
    /* Simulate the task prologue: All input data is copied to local storage. A critical
       section is granted implicitly since this task has the highest priority. According
       code is ommitted and we can combine all busy waits to a single one. */
                                                                                            
