PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/benchmark/mai_main.c
    /* Simulate the task activity: Computation of results. Note, this task is triggered by
       an asynchronous interrupt but we still use a regular one (5 kHz) so that we can use
       our normal macro to produce defined CPU load. */
    busyWait(LOAD_TASK_PIT2, /* tiCycleInMs */ 0.2f);
    
    /* Increment the alive counter of the task. */                                          
    ++ mai_cntTaskUserPit2;
                                                                                            
    return success? 0: -1;                                                                  
                                                                                            
} /* End of taskUser##tiCycleInMs##ms */




/**
 * Simulated user task. It is characterized mainly by the CPU load in percent is requires
 * to complete.
 *   A small, fixed fraction of the load is spent for the in- and output of the task. We
 * simluate the concept that at the beginning of the task some data is copied into local
 * task storage, before the actual task computations start and that - after computation -
 * another small fraction of the computation time is required to store the data for use by
 * other tasks.
 *   For our intention, getting a measure for the cost of the kernel, the actual
 * operations, copying data, doing some computations, copying data, doesn't matter at all.
 * However, it matters that copying data has to be done inside critical sections. This has
 * an impact on scheduling timing and it is a relative expensive operation for a safe
 * kernel, which must not offer the cheap suspension of all interrupts.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process. This mechanism is used to report a problem in PRODUCTION
 * compilation, when we have no assertions available.
 *   @param PID
 * The ID of the process, the task function is executed in.
 */
#define USER_TASK(tiCycleInMs, cpuLoad, prioCritSec)                                        \
                                                                                            \
/** Counter of cycles of infinite main loop. */                                             \
volatile unsigned long SBSS_P1(mai_cntTaskUser##tiCycleInMs##ms) = 0;                       \
                                                                                            \
static int32_t taskUser##tiCycleInMs##ms(uint32_t PID ATTRIB_UNUSED)                        \
{                                                                                           \
    bool success = true;                                                                    \
                                                                                            \
    /* Simulate the task prologue: All input data is copied to local storage. This is done  \
       in a critical section, which includes all competing tasks. */                        \
    if(prioEv##tiCycleInMs##ms < prioCritSec){ getResource(prioCritSec); }                  \
    busyWait(REL_LOAD_TASK_INTERFACE*cpuLoad, tiCycleInMs);                                 \
    if(prioEv##tiCycleInMs##ms < prioCritSec){ releaseResource(prioEv##tiCycleInMs##ms); }  \
                                                                                            \
    /* Simulate the task activity: Computation of results. */                               \
    busyWait(REL_LOAD_TASK_COMPUTATION*cpuLoad, tiCycleInMs);                               \
    /* Increment the alive counter of the task. */                                          \
    ++ mai_cntTaskUser##tiCycleInMs##ms;                                                    \
                                                                                            \
    /* Simulate the task epilogue: All computed data is copied to shared, global storage.   \
       This is done in a critical section, which includes all competing tasks. */           \
    if(prioEv##tiCycleInMs##ms < prioCritSec){ getResource(prioCritSec); }                  \
    busyWait(REL_LOAD_TASK_INTERFACE*cpuLoad, tiCycleInMs);                                 \
    if(prioEv##tiCycleInMs##ms < prioCritSec){ releaseResource(prioEv##tiCycleInMs##ms); }  \
                                                                                            \
    return success? 0: -1;                                                                  \
                                                                                            \
} /* End of taskUser##tiCycleInMs##ms */                                                    \
                                                                                            \
/* End of macro USER_TASK */

USER_TASK(/* tiCycleInMs */ 1,    /* cpuLoad */ LOAD_TASK_1MS,    /* prioCritSec */ prioEv1ms)
USER_TASK(/* tiCycleInMs */ 10,   /* cpuLoad */ LOAD_TASK_10MS,   /* prioCritSec */ prioEv5ms)
USER_TASK(/* tiCycleInMs */ 100,  /* cpuLoad */ LOAD_TASK_100MS,  /* prioCritSec */ prioEv10ms)
USER_TASK(/* tiCycleInMs */ 1000, /* cpuLoad */ LOAD_TASK_1000MS, /* prioCritSec */ prioEv10ms)

#undef USER_TASK




/**
 * Simulated OS task. It is characterized mainly by the CPU load in percent is requires
 * to complete.
 *   A small, fixed fraction of the load is spent for the in- and output of the task. We
 * simluate the concept that at the beginning of the task some data is copied into local
 * task storage, before the actual task computations start and that - after computation -
 * another small fraction of the computation time is required to store the data for use by
 * other tasks.
 *   For our intention, getting a measure for the cost of the kernel, the actual
 * operations, copying data, doing some computations, copying data, don't matter at all.
 * However, it matters that copying data has to be done inside critical sections. This has
 * an impact on scheduling timing and it is a relative expensive operation for a safe
 * kernel, which must not offer the cheap suspension of all interrupts.
 */
#define OS_TASK(tiCycleInMs, cpuLoad, prioCritSec)                                          \
                                                                                            \
/** Counter of cycles of infinite main loop. */                                             \
volatile unsigned long SBSS_OS(mai_cntTaskOS##tiCycleInMs##ms) = 0;                         \
                                                                                            \
static void taskOS##tiCycleInMs##ms(void)                                                   \
{                                                                                           \
    /* Simulate the task prologue: All input data is copied to local storage. This is done  \
       in a critical section, which includes all competing tasks. */                        \
    if(prioEv##tiCycleInMs##ms < prioCritSec){ osGetResource(prioCritSec); }                \
    busyWait(REL_LOAD_TASK_INTERFACE*cpuLoad, tiCycleInMs);                                 \
    if(prioEv##tiCycleInMs##ms < prioCritSec){ osReleaseResource(prioEv##tiCycleInMs##ms); }\
                                                                                            \
    /* Simulate the task activity: Computation of results. */                               \
    busyWait(REL_LOAD_TASK_COMPUTATION*cpuLoad, tiCycleInMs);                               \
    /* Increment the alive counter of the task. */                                          \
    ++ mai_cntTaskOS##tiCycleInMs##ms;                                                      \
                                                                                            \
    /* Simulate the task epilogue: All computed data is copied to shared, global storage.   \
       This is done in a critical section, which includes all competing tasks. */           \
    if(prioEv##tiCycleInMs##ms < prioCritSec){ osGetResource(prioCritSec); }                \
    busyWait(REL_LOAD_TASK_INTERFACE*cpuLoad, tiCycleInMs);                                 \
    if(prioEv##tiCycleInMs##ms < prioCritSec){ osReleaseResource(prioEv##tiCycleInMs##ms); }\
                                                                                            \
} /* End of taskOS##tiCycleInMs##ms */                                                      \
                                                                                            \
/* End of macro OS_TASK */

OS_TASK(/* tiCycleInMs */ 1,  /* cpuLoad */ LOAD_TASK_OS_1MS,  /* prioCritSec */ prioEvPit2)
OS_TASK(/* tiCycleInMs */ 5,  /* cpuLoad */ LOAD_TASK_OS_5MS,  /* prioCritSec */ prioEv1ms)
OS_TASK(/* tiCycleInMs */ 10, /* cpuLoad */ LOAD_TASK_OS_10MS, /* prioCritSec */ prioEv10ms)

#undef OS_TASK


/**
 * Simulated safety task. It is characterized mainly by the CPU load in percent is requires
 * to complete.
 */
static int32_t taskSafety1ms(uint32_t PID ATTRIB_UNUSED)
{
    busyWait(LOAD_TASK_SAFETY_1MS, /* tiCycleInMs */ 1);

    /* Increment the alive counter of the task. */
    ++ mai_cntTaskSafety1ms;

