PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/benchmark/mai_main.c
    return 0;

} /* End of taskSafety1ms */



/**
 * Idle task implementation.
 */
static void taskOSIdle(void)
{
    /* Compute the average CPU load. Note, this operation lasts about 1.5s and has a
       significant impact on the cycling speed of the idle task. Furthermore, it
       measures only the load produced by the tasks and system interrupts but not that
       of the rest of the code in this function. Therefore, we can do some supervision and
       reporting without biasing the measurement results. */
    mai_cpuLoad = gsl_getSystemLoad();
    const unsigned int simulatedCpuLoad = (LOAD_TASK_SAFETY_1MS    
                                           + LOAD_TASK_PIT2
                                           + LOAD_TASK_1MS
                                           + LOAD_TASK_10MS          
                                           + LOAD_TASK_100MS         
                                           + LOAD_TASK_1000MS        
                                           + LOAD_TASK_OS_1MS        
                                           + LOAD_TASK_OS_5MS        
                                           + LOAD_TASK_OS_10MS       
                                          ) * 10;
    unsigned int cpuLoadKernel = simulatedCpuLoad;
    if(mai_cpuLoad > cpuLoadKernel)
        cpuLoadKernel = mai_cpuLoad - cpuLoadKernel;
    else
        cpuLoadKernel = 0;

    /* Make spinning of the idle task observable in the debugger. */
    ++ mai_cntTaskIdle;

    const unsigned int stackReserveOs = rtos_getStackReserve(pidOs)
                     , stackReserveP1 = rtos_getStackReserve(/* PID */ 1)
                     , stackReserveP2 = rtos_getStackReserve(/* PID */ 2);

    const bool success = rtos_getNoTotalTaskFailure(/* PID */ 1) == 0
                         &&  rtos_getNoTotalTaskFailure(/* PID */ 2) == 0
                         &&  stackReserveOs >= 4096
                         &&  stackReserveP1 >= 1024
                         &&  stackReserveP2 >= 1024
                         ;
    char msg[256];
    signed int noChar;
    if(success)
    {
        /* Normal operation: Let green LED blink slowly. */
        lbd_osSetLED(lbd_led_D4_grn, /* isOn */ (mai_cntTaskIdle & 1) != 0);
        /* Print some results. */

        noChar = sniprintf( msg, sizeof(msg)
                          , "CPU load: %u%% (Simulated: %u%%, kernel: %u ppmille)\r\n"
                          , (mai_cpuLoad+5)/10
                          , (simulatedCpuLoad+5)/10
                          , cpuLoadKernel
                          );
        assert((unsigned)noChar < sizeOfAry(msg));
        sio_osWriteSerial(msg, (unsigned)noChar);

        noChar = sniprintf( msg, sizeof(msg)
                          , "Cycles user tasks (Pit2, 1, 10, 100, 1000 ms): %lu, %lu, %lu,"
                            " %lu, %lu\r\n"
                          , mai_cntTaskUserPit2
                          , mai_cntTaskUser1ms
                          , mai_cntTaskUser10ms
                          , mai_cntTaskUser100ms
                          , mai_cntTaskUser1000ms
                          );
        assert((unsigned)noChar < sizeOfAry(msg));
        sio_osWriteSerial(msg, (unsigned)noChar);

        noChar = sniprintf( msg, sizeof(msg)
                          , "Cycles OS tasks (1, 5, 10 ms): %lu, %lu, %lu\r\n"
                          , mai_cntTaskOS1ms
                          , mai_cntTaskOS5ms
                          , mai_cntTaskOS10ms
                          );
        assert((unsigned)noChar < sizeOfAry(msg));
        sio_osWriteSerial(msg, (unsigned)noChar);

        noChar = sniprintf( msg, sizeof(msg)
                          , "Cycles safety task: %lu\r\n"
                          , mai_cntTaskSafety1ms
                          );
        assert((unsigned)noChar < sizeOfAry(msg));
        sio_osWriteSerial(msg, (unsigned)noChar);
        
        noChar = sniprintf( msg, sizeof(msg)
                          , "Cycles of ISRs: %lu, %lu, %lu\r\n"
                          , mai_cntISRPit1
                          , mai_cntISRPit2
                          , mai_cntISRPit3
                          );
        assert((unsigned)noChar < sizeOfAry(msg));
        sio_osWriteSerial(msg, (unsigned)noChar);
        
    }
    else if(!rtos_isProcessSuspended(/* PID */ 1))
    {
        /* Transition to suspend state for process 1: Turn green LED off. */
        lbd_osSetLED(lbd_led_D4_grn, /* isOn */ false);
        rtos_osSuspendProcess(/* PID */ 1);
        
        noChar = sniprintf( msg, sizeof(msg)
                          , "Fatal error detected. Process 1 is suspended!\r\n"
                          );
        assert((unsigned)noChar < sizeOfAry(msg));
        sio_osWriteSerial(msg, (unsigned)noChar);
    }
    else
    {
        /* Failure: Let red LED blink. */
        lbd_osSetLED(lbd_led_D4_red, /* isOn */ (mai_cntTaskIdle & 1) != 0);
    }
    
} /* End of taskOSIdle */



/**
 * This demonstration software uses a number of fast interrupts to produce system load and
 * prove stability. The interrupts are timer controlled (for simplicity) but the
 * activations are chosen as asynchronous to the operating system clock as possible to
 * provoke a most variable preemption pattern.
 */
static void installInterruptServiceRoutines(void)
{
    _Static_assert(prioIrqPit1 >= 1  &&  prioIrqPit1 <= 15
                   &&  prioIrqPit2 >= 1  &&  prioIrqPit2 <= 15
                   &&  prioIrqPit3 >= 1  &&  prioIrqPit3 <= 15
                  , "Interrupt priority out of range"
                  );
    _Static_assert(prioIrqPit1 > RTOS_KERNEL_IRQ_PRIORITY
                   ||  prioIrqPit2 > RTOS_KERNEL_IRQ_PRIORITY
                   ||  prioIrqPit3 > RTOS_KERNEL_IRQ_PRIORITY
                  , "By intention, at least one interrupt should have a priority above the"
                    " scheduler of the RTOS"
                  );
    _Static_assert(prioIrqPit1 < RTOS_KERNEL_IRQ_PRIORITY
                   ||  prioIrqPit2 < RTOS_KERNEL_IRQ_PRIORITY
                   ||  prioIrqPit3 < RTOS_KERNEL_IRQ_PRIORITY
                  , "By intention, at least one interrupt should have a priority below the"
                    " scheduler of the RTOS"
                  );
    _Static_assert(prioIrqPit1 == RTOS_KERNEL_IRQ_PRIORITY
                   ||  prioIrqPit2 == RTOS_KERNEL_IRQ_PRIORITY
                   ||  prioIrqPit3 == RTOS_KERNEL_IRQ_PRIORITY
                  , "By intention, at least one interrupt should have the priority of the"
                    " scheduler of the RTOS"
                  );
                  
