PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/benchmark/mai_main.c
    /* 0x2: Disable all PIT timers during configuration. Note, this is a
       global setting for all four timers. Accessing the bits makes this rountine have race
       conditions with the RTOS initialization that uses timer PIT0. Both routines must not
       be called in concurrency. */
    PIT.PITMCR.R |= 0x2u;

    /* Install the ISRs now that all timers are stopped.
         Vector numbers: See MCU reference manual, section 28.7, table 28-4. */
    rtos_osRegisterInterruptHandler( &isrPit1
                                   , /* vectorNum */ 60
                                   , /* psrPriority */ prioIrqPit1
                                   , /* isPreemptable */ true
                                   );
    rtos_osRegisterInterruptHandler( &isrPit2
                                   , /* vectorNum */ 61
                                   , /* psrPriority */ prioIrqPit2
                                   , /* isPreemptable */ true
                                   );
    rtos_osRegisterInterruptHandler( &isrPit3
                                   , /* vectorNum */ 127
                                   , /* psrPriority */ prioIrqPit3
                                   , /* isPreemptable */ true
                                   );

    /* Peripheral clock has been initialized to 120 MHz. The timer counts at this rate. The
       RTOS operates in ticks of 1ms we use prime numbers to get good asynchronity with the
       RTOS clock.
         Note, one interrupt is much slower than the two others. The reason is it does much
       more, it takes part at the test of safely accessing data shared with the application
       tasks.
         -1: See MCU reference manual, 36.5.1, p. 1157. */
    PIT.LDVAL1.R = 119993-1;/* Interrupt rate approx. 1 kHz */
    PIT.LDVAL2.R = 24001-1; /* Interrupt rate approx. 5 kHz */
    PIT.LDVAL3.R = 11987-1; /* Interrupt rate approx. 10 kHz */

    /* Enable interrupts by the timers and start them. */
    PIT.TCTRL1.R = 0x3;
    PIT.TCTRL2.R = 0x3;
    PIT.TCTRL3.R = 0x3;

    /* Enable timer operation, all four timers are affected. Interrupt processing should
       start. */
    PIT.PITMCR.R &= ~0x2u;

} /* End of installInterruptServiceRoutines */



/**
 * C entry function main. Is used for and only for the Z7_0 core.
 *   @param noArgs
 * Number of arguments in \a argAry. Is actually always equal to zero.
 *   @param argAry
 * Array of string arguments to the function. Is actually always equal to NULL.
 */
int main(int noArgs ATTRIB_DBG_ONLY, const char *argAry[] ATTRIB_DBG_ONLY)
{
    /* The arguments of the main function are quite useless. Just check correctness. */
    assert(noArgs == 0  &&  argAry == NULL);


    /* The first operation of the main function is the call of ihw_initMcuCoreHW(). The
       assembler implemented startup code has brought the MCU in a preliminary working
       state, such that the C compiler constructs can safely work (e.g. stack pointer is
       initialized, memory access through MMU is enabled).
         ihw_initMcuCoreHW() does the remaining hardware initialization, that is still
       needed to bring the MCU in a basic stable working state. The main difference to the
       preliminary working state of the assembler startup code is the selection of
       appropriate clock rates.
         This part of the hardware configuration is widely application independent. The
       only reason, why this code has not been called directly from the assembler code
       prior to entry into main() is code transparency. It would mean to have a lot of C
       code without an obvious point, where it is called. */
    ihw_initMcuCoreHW();

    /* The core is now running in the desired state. I/O driver initialization follows to
       the extend required by this simple sample. */

    /* The interrupt controller is configured. This is the first driver initialization
       call: Many of the others will register their individual ISRs and this must not be
       done prior to initialization of the interrupt controller. */
    rtos_osInitINTCInterruptController();

    /* Initialize the button and LED driver for the eval board. */
    lbd_osInitLEDAndButtonDriver( /* onButtonChangeCallback */ NULL
                                , /* pidOnButtonChangeCallback */ 0
                                );

    /* Initialize the serial output channel as prerequisite of using printf. */
    sio_osInitSerialInterface(/* baudRate */ 115200);

    /* Register the process initialization tasks. */
    bool initOk = true;
    if(rtos_osRegisterInitTask(taskInitProcess, /* PID */ 1, /* tiTaskMaxInUS */ 1000)
       != rtos_err_noError
       ||  rtos_osRegisterInitTask(taskInitProcess, /* PID */ 2, /* tiTaskMaxInUS */ 1000)
           != rtos_err_noError
      )
    {
        initOk = false;
    }


#define CREATE_EVENT(name, tiCycleInMs)                                                     \
    if(initOk                                                                               \
       &&  rtos_osCreateEvent( &idEvent                                                     \
                             , /* tiCycleInMs */              tiCycleInMs                   \
                             , tiCycleInMs>0? tiFirstActivationInMs: 0                      \
                             , /* priority */                 prioEv##name                  \
                             , /* minPIDToTriggerThisEvent */                               \
                                                         RTOS_EVENT_NOT_USER_TRIGGERABLE    \
                             )                                                              \
           != rtos_err_noError                                                              \
      )                                                                                     \
    {                                                                                       \
        initOk = false;                                                                     \
    }                                                                                       \
    assert(idEvent == idEv##name);                                                          \
    if(tiCycleInMs > 0)                                                                     \
        ++ tiFirstActivationInMs;                                                           \
                                                                                            \
/* End of macro CREATE_EVENT */

