PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/benchmark/mai_main.c
    unsigned int tiFirstActivationInMs = 0
               , idEvent = 0;
    CREATE_EVENT(/* name */ 1msSafety, /* tiCycleInMs */ 1)
    CREATE_EVENT(/* name */ Pit2,      /* tiCycleInMs */ 0)
    CREATE_EVENT(/* name */ 1ms,       /* tiCycleInMs */ 1)
    CREATE_EVENT(/* name */ 5ms,       /* tiCycleInMs */ 5)
    CREATE_EVENT(/* name */ 10ms,      /* tiCycleInMs */ 10)
    CREATE_EVENT(/* name */ 100ms,     /* tiCycleInMs */ 100)
    CREATE_EVENT(/* name */ 1000ms,    /* tiCycleInMs */ 1000)

#undef CREATE_EVENT

#define CREATE_USER_TASK(name)                                                              \
    if( initOk                                                                              \
        &&  rtos_osRegisterUserTask( idEv##name                                             \
                                   , taskUser##name                                         \
                                   , pidTask##name                                          \
                                   , /* tiTaskMaxInUs */ 0                                  \
                                   )                                                        \
            != rtos_err_noError                                                             \
      )                                                                                     \
    {                                                                                       \
        initOk = false;                                                                     \
    }                                                                                       \
/* End of macro CREATE_USER_TASK */

    CREATE_USER_TASK(/* name */ Pit2)
    CREATE_USER_TASK(/* name */ 1ms)
    CREATE_USER_TASK(/* name */ 10ms)
    CREATE_USER_TASK(/* name */ 100ms)
    CREATE_USER_TASK(/* name */ 1000ms)

#undef CREATE_USER_TASK

#define CREATE_OS_TASK(name)                                                                \
    if( initOk                                                                              \
        &&  rtos_osRegisterOSTask(idEv##name, taskOS##name)                                 \
            != rtos_err_noError                                                             \
      )                                                                                     \
    {                                                                                       \
        initOk = false;                                                                     \
    }                                                                                       \
/* End of macro CREATE_OS_TASK */

    CREATE_OS_TASK(/* name */ 1ms)
    CREATE_OS_TASK(/* name */ 5ms)
    CREATE_OS_TASK(/* name */ 10ms)

#undef CREATE_OS_TASK

    /* Create the safety task. */
    if( initOk
        &&  rtos_osRegisterUserTask( idEv1msSafety
                                   , taskSafety1ms
                                   , pidTask1msSafety
                                   , /* tiTaskMaxInUs */ 0
                                   )
            != rtos_err_noError
      )
    {
        initOk = false;
    }

    /* The last check ensures that we didn't forget to register an event. */
    assert(initOk &&  idEvent == noRegisteredEvents-1);

    rtos_osGrantPermissionSuspendProcess( /* pidOfCallingTask */ 2 /* Supervisor */
                                        , /* targetPID */ 1        /* All user tasks */
                                        );

    /* Installing irrelated interrupts should be possible before the system is running.
       We place the PIT timer initialization here to prove this statement. Interrupt
       handling is generally disabled until the RTOS kernel starts up so there should be no
       activation losses or other harm. */
    installInterruptServiceRoutines();
    del_delayMicroseconds(500000);

    /* Initialize the RTOS kernel. The global interrupt processing is resumed if it
       succeeds. The step involves a configuration check. We must not startup the SW if the
       check fails. */
    if(!initOk ||  rtos_osInitKernel() != rtos_err_noError)
        while(true)
            ;

    /* Here we are in the idle task. */
    while(true)
        taskOSIdle();

} /* End of main */
